{
    "skills":
    {   "hardSkill1": "Базовая теория (Что такое тестирование, багрепорты, документация, виды, методы, направления тестирования и т.п.) SDLC, STLC.",
        "hardSkill2": "Что такое клиент-серверная архитектура.",
        "hardSkill3": "HTTP Методы запросов на сервер.",
        "hardSkill4": "Коды ответов HTTP сервера.",
        "hardSkill5": "Структуры HTTP запросов и ответов.",
        "hardSkill6": "Что такое JSON, XML. Их структура.",
        "hardSkill7": "Тестирование API через Postman (JS, автотесты API).",
        "hardSkill8": "Снятие и чтение логов c внешнего сервера.",
        "hardSkill9": "Снифинг http web трафика через Charles и Fiddler.",
        "hardSkill10": "Dev Tools веб браузеров (Google Chrome, FireFox).",
        "hardSkill11": "VPN. (Как работает, зачем нужен, как использовать, варианты инструментов)",
        "hardSkill12": "Мобильное тестирование.",
        "hardSkill13": "Особенность iOS, Android, гайдлайны.",
        "hardSkill14": "Сборка iOS приложений на XCode. (У кого нет Mac компьютера, просто посмотрят)",
        "hardSkill15": "Сборка Android приложений на Android Studio.",
        "hardSkill16": "ADB (управление андройд девайсами).",
        "hardSkill17": "Настройка прокси и vpn на iOS и Android.",
        "hardSkill18": "Перехват (сниффинг) мобильного трафика через Charles и Fiddler на iOS и Android.",
        "hardSkill19": "Командная строка (terminal) Linux (копирование, создание, просмотр, перемещение файлов на серверах без графического интерфейса)",
        "hardSkill20": "Основы bash скриптинг, автоматизация рутинных задач на сервере.",
        "hardSkill21": "Доступ к удалённым серверам.",
        "hardSkill22": "Основы SQL (Create, Delete, Drop, Insert Into, Select, From, Where, Join).",
        "hardSkill23": "База данных Postgres (установка, настройка и использование).",
        "hardSkill24": "Нереляционная база данных Redis (установка, настройка и использование).",
        "hardSkill25": "Нагрузочное тестирование в Jmeter.",
        "hardSkill26": "Методология разработки Scrum.",
        "hardSkill27": "Python. (Изучение основ. Создание клиент серверного приложения)"
    }
}